// Синтаксис Вычисляемого свойства - объект["поле"]


// 1. Спросить у пользователя число и единицу измерения
// В обьект tail в свойство с названием единицы изм. записать значение числа от пользователя


// let unit = prompt("Введите название единици измерения");
// let number = Number(prompt("Введите число"));

// const tail = {
//   [unit]: number
// }

// console.log(tail);



// 2. Создать объект со свойствами box1, box2, box3, box... до 5
// Заполнить свойства null
// const obj = {};
// for (let i = 1; i < 6; i++) {
//   obj[`box${i}`] = null;
// }
// console.log(obj);